package javaBasicExercises.part3;

/*
*	javaSE专项练习23
*	@author  zaichiyikoua
*	@time  2019年12月27日
*/

public class Coding23 {
    // 正则表达式
//	\d      匹配一个数字字符。等价于 [0-9]。
//	\D     匹配一个非数字字符。等价于 [^0-9]。
//	\f       匹配一个换页符。等价于 \x0c 和 \cL。
//	\n      匹配一个换行符。等价于 \x0a 和 \cJ。
//	\r       匹配一个回车符。等价于 \x0d 和 \cM。
//	\s      匹配任何空白字符，包括空格、制表符、换页符等等。等价于 [ \f\n\r\t\v]。
//	\S      匹配任何非空白字符。等价于 [^ \f\n\r\t\v]。
//	\t       匹配一个制表符。等价于 \x09 和 \cI。
//	\v      匹配一个垂直制表符。等价于 \x0b 和 \cK。
//	\w     匹配字母、数字、下划线。等价于'[A-Za-z0-9_]'。
//	\W    匹配非字母、数字、下划线。等价于 '[^A-Za-z0-9_]'。
}
